---
kind: method
id: M:Autodesk.Revit.DB.ReferenceWithContext.GetInstanceTransform
source: html/0a0ebb47-03a3-5fdf-9978-437c8447f102.htm
---
# Autodesk.Revit.DB.ReferenceWithContext.GetInstanceTransform Method

Gets the transform of the instance.

## Syntax (C#)
```csharp
public Transform GetInstanceTransform()
```

## Returns
The transform of an instance when the reference is returned by FindReferencesWithContextByDirection(XYZ, XYZ, View3D) or ReferenceIntersector.Find(XYZ, XYZ).